# Join the Data Frame

In [9]:
import pandas as pd

apples = pd.Series([3,2,0,1]) #Series generation with pandas
oranges = pd.Series([3,4,7,8])

#print(apples,oranges)

print("************ merging the series with function DataFrame ************\n ")
data = {"apples":apples,"oranges":oranges}
fruits_df = pd.DataFrame(data) 
#merging the series with function DataFrame if index will match it merge but if index is not present it will give it itself

print(fruits_df)

************ merging the series with function DataFrame ************

   apples  oranges
0       3        3
1       2        4
2       0        7
3       1        8

In [12]:
state = ['ohio','ohio','ohio','Neveda','Neveda','Neveda']
data = {
    'state': state,
    'year': [2000,2001,2002,2001,2002,2003],
    'pop':[1.5,1.7,3.6,2.4,2.9,3.2] }

state_pop_df = pd.DataFrame(data,index=['1st','2nd','3rd','4th','5th','6th'])
print(state_pop_df)

      state  year  pop
1st    ohio  2000  1.5
2nd    ohio  2001  1.7
3rd    ohio  2002  3.6
4th  Neveda  2001  2.4
5th  Neveda  2002  2.9
6th  Neveda  2003  3.2

# Head() & Tail() function

In [16]:
#head()will give 5 starting values while Tail() give last 5 values

In [14]:
state_pop_df = pd.DataFrame(data,columns=['year','state','pop'])
state_pop_df.head()

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  Neveda  2.4
4  2002  Neveda  2.9

In [15]:
state_pop_df = pd.DataFrame(data,columns=['year','state','pop'])
state_pop_df.tail()

   year   state  pop
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  Neveda  2.4
4  2002  Neveda  2.9
5  2003  Neveda  3.2

In [17]:
frame2 = pd.DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five','six'])
frame2.head()

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  Neveda  2.4  NaN
five   2002  Neveda  2.9  NaN

In [18]:
print(frame2.columns)

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [20]:
print(frame2.index)

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [21]:
frame2.state #attribute style of accessing

one        ohio
two        ohio
three      ohio
four     Neveda
five     Neveda
six      Neveda
Name: state, dtype: object

In [28]:
print(frame2.loc['two'])
print("XXXXX")
print(state_pop_df.head())
print("XXXXX")
print(frame2.head())

year     2001
state    ohio
pop       1.7
debt      NaN
Name: two, dtype: object
XXXXX
   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  Neveda  2.4
4  2002  Neveda  2.9
XXXXX
       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  Neveda  2.4  NaN
five   2002  Neveda  2.9  NaN

In [31]:
ln = len(frame2)
print(ln)

6

In [33]:
import numpy as np
a = np.arange(ln)
print(a)
frame2['debt']=a
frame2

[0 1 2 3 4 5]

       year   state  pop  debt
one    2000    ohio  1.5     0
two    2001    ohio  1.7     1
three  2002    ohio  3.6     2
four   2001  Neveda  2.4     3
five   2002  Neveda  2.9     4
six    2003  Neveda  3.2     5

In [ ]:
import numpy as np
import pandas as pd

data_df= pd.DataFrame(np.arange(16).reshape(4,4)),
                    index=['Ohio','Colorado','Utah','New York'],
                    columns=['one','two','three','four']
        
print(data_df,"\n")

print(data_df.loc[
    ['Colo']
])

In [43]:
df1= pd.DataFrame(np.arange(9.).reshape((3,3)),columns=list('bcd'),index = ['Ohio','Texas','Colorada'])
df2= pd.DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index = ['Utah','Ohio','Texas','Oregon'])
df3=df1+df2
print(df1)
print(df2)
print(df3)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorada  6.0  7.0  8.0
          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0
            b   c     d   e
Colorada  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN